In [1]:
import numpy as np
import pandas as pd

In [8]:
df = pd.read_csv('exemplo.csv')

In [3]:
df.head()

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

### Chacagem de valores nulos

In [4]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True

In [5]:
df.isna().sum()

A    0
B    0
C    1
D    1
dtype: int64

### Eliminos amostra com valores faltantes

Comando não altera o valor do df original
axis=0 -> elimina as linha

In [6]:
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

df.dropna(axis=0, inplace=true) inplace altera o df original

axis=1 -> elimina as colunas

In [7]:
df.dropna(axis=1)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

foi adicionado mais duas linhas, uma delas sendo nula

In [10]:
df.head()

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN
3   NaN   NaN   NaN  NaN
4   2.0   3.0   1.0  5.0

In [9]:
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0
4  2.0  3.0  1.0  5.0

Elimina as linhas que contem valores nulos na coluna C

In [11]:
df.dropna(subset=['C'])

      A     B     C    D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN
4   2.0   3.0   1.0  5.0

Elimina as linhas 0 e 1

In [12]:
df.drop(labels=[0,1])

      A     B     C    D
2  10.0  11.0  12.0  NaN
3   NaN   NaN   NaN  NaN
4   2.0   3.0   1.0  5.0

Elimina as colunas A e C

In [13]:
df.drop(labels=['A','C'], axis=1)

      B    D
0   2.0  4.0
1   6.0  8.0
2  11.0  NaN
3   NaN  NaN
4   3.0  5.0

### Assinalar valores aos faltantes

In [14]:
from sklearn.preprocessing import Imputer

In [15]:
df_ = df.dropna(how='all')

In [19]:
# exis=0 no Imputer é o eixo das colunas
prep = Imputer(missing_values='NaN', strategy='mean', axis=0)
prep = prep.fit(df_)
dados = prep.transform(df_)
dados

array([[ 1.        ,  2.        ,  3.        ,  4.        ],
       [ 5.        ,  6.        ,  5.33333333,  8.        ],
       [10.        , 11.        , 12.        ,  5.66666667],
       [ 2.        ,  3.        ,  1.        ,  5.        ]])

recriando dataframe

In [20]:
pd.DataFrame(dados, columns=df_.columns)

      A     B          C         D
0   1.0   2.0   3.000000  4.000000
1   5.0   6.0   5.333333  8.000000
2  10.0  11.0  12.000000  5.666667
3   2.0   3.0   1.000000  5.000000

Leitura de arquivo xlsx (exel)

In [23]:
df2 = pd.read_excel('exemplo2.xlsx')

In [24]:
df2.head()

   color size  price    label
0  green    M   10.1  classe1
1    red    L   13.5  classe2
2   blue   XL   15.3  classe1